; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	satellite2 - satellite
	instrument2 - instrument
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	satellite3 - satellite
	instrument6 - instrument
	instrument7 - instrument
	instrument8 - instrument
	image0 - mode
	infrared1 - mode
	Star9 - direction
	GroundStation8 - direction
	GroundStation10 - direction
	Star1 - direction
	Star6 - direction
	Star7 - direction
	GroundStation5 - direction
	GroundStation13 - direction
	Star4 - direction
	GroundStation3 - direction
	Star12 - direction
	Star2 - direction
	Star11 - direction
	GroundStation0 - direction
	GroundStation14 - direction
	Phenomenon15 - direction
)
(:init
	(supports instrument0 image0)
	(calibration_target instrument0 GroundStation3)
	(calibration_target instrument0 GroundStation8)
	(calibration_target instrument0 Star11)
	(calibration_target instrument0 GroundStation13)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star7)
	(supports instrument1 image0)
	(supports instrument1 infrared1)
	(calibration_target instrument1 GroundStation8)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star7)
	(supports instrument2 image0)
	(supports instrument2 infrared1)
	(calibration_target instrument2 Star4)
	(calibration_target instrument2 Star2)
	(calibration_target instrument2 Star11)
	(calibration_target instrument2 Star6)
	(calibration_target instrument2 GroundStation10)
	(supports instrument3 infrared1)
	(supports instrument3 image0)
	(calibration_target instrument3 Star1)
	(calibration_target instrument3 Star12)
	(calibration_target instrument3 Star4)
	(supports instrument4 infrared1)
	(supports instrument4 image0)
	(calibration_target instrument4 Star7)
	(calibration_target instrument4 Star6)
	(calibration_target instrument4 GroundStation3)
	(calibration_target instrument4 Star12)
	(supports instrument5 infrared1)
	(calibration_target instrument5 Star11)
	(calibration_target instrument5 Star4)
	(calibration_target instrument5 GroundStation0)
	(calibration_target instrument5 GroundStation13)
	(calibration_target instrument5 GroundStation5)
	(on_board instrument2 satellite2)
	(on_board instrument3 satellite2)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star7)
	(supports instrument6 infrared1)
	(calibration_target instrument6 Star12)
	(calibration_target instrument6 GroundStation3)
	(supports instrument7 infrared1)
	(supports instrument7 image0)
	(calibration_target instrument7 GroundStation0)
	(calibration_target instrument7 Star11)
	(calibration_target instrument7 Star2)
	(supports instrument8 infrared1)
	(supports instrument8 image0)
	(calibration_target instrument8 GroundStation14)
	(calibration_target instrument8 GroundStation0)
	(on_board instrument6 satellite3)
	(on_board instrument7 satellite3)
	(on_board instrument8 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star2)
)
(:goal (and
	(pointing satellite0 GroundStation14)
	(pointing satellite1 GroundStation14)
	(have_image Phenomenon15 image0)
))

)

; plan
1. (turn_to satellite0 groundstation14 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 groundstation14)
   goals met: 1 of 3
2. (switch_on instrument4 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument4)
   goals met: 1 of 3
3. (calibrate satellite2 instrument4 star7)
   added: (calibrated instrument4)
   goals met: 1 of 3
4. (turn_to satellite1 groundstation14 star7)
   deleted: (pointing satellite1 star7)
   added: (pointing satellite1 groundstation14)
   goals met: 2 of 3
5. (turn_to satellite2 phenomenon15 star7)
   deleted: (pointing satellite2 star7)
   added: (pointing satellite2 phenomenon15)
   goals met: 2 of 3
6. (take_image satellite2 phenomenon15 instrument4 image0)
   added: (have_image phenomenon15 image0)
   goals met: 3 of 3
